Infineon/IMR_PSoC6_BMS/bsps/TARGET_CY8C6245AZI-S3D72/config/GeneratedSource/cycfg_pins.h
extern const cy_stc_gpio_pin_config_t CYBSP_WCO_IN_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_WCO_IN_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_WCO_OUT_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_WCO_OUT_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_DEBUG_UART_RX_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_DEBUG_UART_RX_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_DEBUG_UART_TX_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_DEBUG_UART_TX_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t LED_Red_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t LED_Red_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t BMS_LED1_GR_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t BMS_LED1_GR_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ADC_2ED4820_CSO_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ADC_2ED4820_CSO_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ADC_CODING_RES_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ADC_CODING_RES_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ioss_0_port_12_pin_6_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ioss_0_port_12_pin_6_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ioss_0_port_12_pin_7_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ioss_0_port_12_pin_7_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t WPn_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t WPn_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t HOLDn_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t HOLDn_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_CANFD_RX_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_CANFD_RX_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_CANFD_TX_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_CANFD_TX_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CANFD_STB_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CANFD_STB_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t CYBSP_SWITCH_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t CYBSP_SWITCH_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ioss_0_port_6_pin_6_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ioss_0_port_6_pin_6_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t ioss_0_port_6_pin_7_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t ioss_0_port_6_pin_7_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t BUTTON_SHUTDOWN_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t BUTTON_SHUTDOWN_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t BMS_LED4_BL_config;
#define GPIO_RELAIS_config BMS_LED4_BL_config
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t BMS_LED4_BL_obj;
    #define GPIO_RELAIS_obj BMS_LED4_BL_obj
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t BMS_LED3_RD_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t BMS_LED3_RD_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t BMS_LED2_OR_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t BMS_LED2_OR_obj;
#endif //defined (CY_USING_HAL)
extern const cy_stc_gpio_pin_config_t VCC_HOLD_config;
#if defined (CY_USING_HAL)
    extern const cyhal_resource_inst_t VCC_HOLD_obj;
#endif //defined (CY_USING_HAL)

void init_cycfg_pins(void);
void reserve_cycfg_pins(void);

#if defined(__cplusplus)
}
#endif


#endif /* CYCFG_PINS_H */
